Repository: MartaMartinsXavier/Internet.nl
Catalog: translations/*/news.po
Languages: pt

source: article .index
pt: observatoriociber-25Jul2022 webcheck-siga-23Set2021 ptsoc-nwes-8Jul2022 relatorio-riscosconflitos-23Jun2022 novostestes-21Mar2022 observatoriociber-07Abr2022

source: article observatoriociber-25Jul2022 body
pt: Saiba mais [aqui](https://www.cncs.gov.pt/docs/boletim-observatoriociber-julho2022.pdf)

source: article observatoriociber-25Jul2022 date
pt: 25 July 2022

source: article observatoriociber-25Jul2022 lead
pt: O Boletim nº 2/2022, do Observatório de Cibersegurança, acaba de ser publicado. Esta edição analisa as ameaças que resultam do cibercrime-como-serviço, uma realidade que tem adquirido particular relevância e que tem promovido a disseminação de incidentes, bem como dificuldades acrescidas à imputação de responsabilidades ao longo de toda a cadeia de cibercriminalidade.

source: article observatoriociber-25Jul2022 title
pt: Observatório de Cibersegurança acabou de lançar o Boletim n.º 2/2022

source: article webcheck-siga-23Set2021 body
pt: Para utilizar esta nova funcionalidade, basta aceder à área reservada e, na secção Domínios, selecionar o(s) domínio(s) que pretende verificar e iniciar os testes no menu AçõesPara conhecer melhor a webcheck.pt, veja o vídeo ['aqui'](https://www.youtube.com/watch?v=lacZ6aQIqwQ&t=1s&ab_channel=Associa%C3%A7%C3%A3oDNS.PT).

source: article webcheck-siga-23Set2021 date
pt: 23 Setembro de 2021

source: article webcheck-siga-23Set2021 lead
pt: O .PT acaba de disponibilizar uma nova funcionalidade no SIGA, que permite a utilização da plataforma webcheck.pt, pelos responsáveis dos nomes de domínio .pt, diretamente na área reservada de gestão de domínios.

source: article webcheck-siga-23Set2021 title
pt: .PT disponibiliza webcheck.pt no SIGA

source: article observatoriociber-07Abr2022 body
pt: Saiba mais [aqui](https://www.cncs.gov.pt/docs/boletim-observatorio-abril2022.pdf)

source: article observatoriociber-07Abr2022 date
pt: 07 Abril 2022

source: article observatoriociber-07Abr2022 lead
pt: O Observatório de Cibersegurança do CNCS acabou de lançar o Boletim n.º 1/2022, no qual se analisa o problema da identificação dos agentes de ameaça no ciberespaço e se explicam as metodologias utilizadas para ultrapassar essa dificuldade. Esta edição apresenta ainda uma panorâmica sobre os tipos de agentes de ameaça mais comuns em Portugal nos últimos anos, de acordo com os Relatórios do Observatório de Cibersegurança.

source: article observatoriociber-07Abr2022 title
pt: Observatório de Cibersegurança acabou de lançar o Boletim n.º 1/2022

source: article improved-internetnl-test-for-modern-internet-standards body
pt: *"Since its first launch in april 2015 over 300.000 tests were executed on Internet.nl. More than 50% of the retested websites show improvements. We hope the improved Internet.nl will be even more helpful for people to test, require and get modern, secure Internet Standards."*, says Gerben Klein Baltink, chair of the Dutch Internet Standards Platform. Internet.nl helps users to check whether their internet is up to date. Do your website, email and internet connection use modern and reliable internet standards? And if they don’t, what can you do about it? Internet.nl is an initiative of the Dutch Internet Standards Platform that pushes the adoption of modern Internet Standards like IPv6, DNSSEC, HTTPS, DMARC, STARTTLS and DANE. In this platform the following partners from the internet community and the Dutch government collaborate: [DHPA](https://dhpa.nl/), [ECP](https://ecp.nl/), [Forum Standaardisatie](https://forumstandaardisatie.nl/), [Internet Society internationaal](https://internetsociety.org/), [Internet Society Nederland](https://isoc.nl/), [ISPConnect](https://ispconnect.nl/), [Ministerie van Economische Zaken](https://www.rijksoverheid.nl/ministeries/ministerie-van-economische-zaken), [NCSC](https://ncsc.nl/), [NLnet](https://nlnet.nl/), [NLnet Labs](https://nlnetlabs.nl/), [RIPE NCC](https://ripe.net/), [SIDN](https://sidn.nl/) and [SURFnet](https://surfnet.nl/). [Open Netlabs](https://www.opennetlabs.com/) / NLnet Labs is responsible for the technical implementation of the Internet.nl website. The new layout is designed by [WBVB](https://wbvb.nl/) and [200OK](https://www.200ok.nl/). --- ## Release notes - Web redesing features: - Site is more easily accessible by users with disabilities; - Site is designed to be accessed by mobile devices; - Tests' details reworked: - Grouped under sections; - Test explanation for every test; - Compact technical details for all servers in a test. - Link to rerun the same test from the results' page; - Aside boxes in the results' page: - Immediately run suggested tests or start new tests; - Follow links to suggested test websites for further testing. - New: We require at least 2 IPv6-enabled nameservers for full score on the IPv6 test. - Bugfixes: - Partial IPv6 connectivity was falsely reported as good result (only visually, the score was correct); - Multiple SPF records were not resulting in error.

source: article improved-internetnl-test-for-modern-internet-standards date
pt: July 17, 2017

source: article improved-internetnl-test-for-modern-internet-standards lead
pt: Today the Internet Standards Platform launches a fully redesigned [Internet.nl](https://internet.nl/) test website. The comprehensive explanations on the improved test website provide more guidance to users to get modern Internet Standards. The redesign makes the website better accessible on mobile devices and for users with disabilities.

source: article improved-internetnl-test-for-modern-internet-standards title
pt: Improved Internet.nl test for modern Internet Standards

source: article internet-draait-om-samenwerking author
pt: olaf-kolkman

source: article internet-draait-om-samenwerking body
pt: The basis for this collaboration is a number of open standards and practices that all the network operators have adopted voluntarily. In fact, voluntary adoptions is one of the core principles of the [Open-Stand paradigm](https://open-stand.org/infographic-the-5-core-principles-of-openstand/). ## Joining the ecosystem When you connect to the Internet, you become a part of its ecosystem. Even more, across the Internet there is no clear line between consumers and suppliers; every participant is a contributor. That comes with a collaborative responsibility: you should consider not only how the global system impacts you, but also the impact you produce on the system through your activity or inactivity. This perspective is especially important in the area of security (also see the [Internet Society&#39;s recent paper on Collaborative Security](https://www.internetsociety.org/collaborativesecurity)). As an end-user, that means that you do all you can to keep your own systems secure, to reduce the risk of their be taken over and used to abuse others. For service providers, that means making specific security features available. Those offerings and measures may not bring an immediate return on the investment, and in the short term they may even lead to additional cost. But they will help to raise the level of security in the system and reinforce confidence in the Internet. And therein lays the problem: there is no direct economic incentive for individual providers to deploy some of these technologies. Can&#39;t their deployment be mandated then? In theory yes, but that approach would go against one the fundamental and foundational principles of the Internet: as an organic system, a network of autonomous networks, not built from a global blueprint but developing in accordance with local needs and conditions, deployment depends on voluntary agreement and collaboration. Forcing security and scalability through global mandates may be slow, and may have unintended side effects. It also assumes that a global consensus can be reached on a multitude of security issues. The voluntary collaborative approach, combined with a continuing dialogue with those who impact and are impacted by certain measures &mdash; the end-users, the policy makers, and the technicians &mdash; allows more flexibility and agility. Measures taken can more easily be adjusted to minimise unintended adverse consequences. ## &quot;The Internet way&quot; Accomplishing global deployment of secure, resilient, future-proof internet technology is better done &quot;the Internet way&quot;: at the initiative of individual actors, based on their own decisions and their own leadership; and through sharing know-how and experience, both voluntary and professionally. One important aspect in getting new innovations deployed is awareness and visibility. Deploying these internet technologies is like installing new plumbing: something has improved, but the water still tastes the same. Leaders who want to inspire their colleagues to follow suit will have to provide some visibility into what their innovations brings. A profound example is the Internet.nl initiative (to be launched soon), in which the Dutch Internet community, a ministry, and a governmental agency have collaborated to set up a website that helps to highlight the status of deployment of key internet technology. The website gives users simple and straightforward information about their own access to various innovative technologies. Some of these technologies contribute to the continued scalability of the Internet (IPv6 support and transparency of the network), while some relate to security (DNSSEC, anti-spam and anti-phishing, and support for encryption). By doing so, the site helps to promote the open standards that will make the Internet more scalable and more secure. It highlights the leaders, and provides the followers with tools and know-how.

source: article internet-draait-om-samenwerking lead
pt: The Internet, as a global system, is a network-of-networks held together by a spirit of collaboration. When information traverses the Internet it may pass through a handful of networks, and the network from which the traffic originated probably has no formal relationship with the network that receives it. The reason why that works is collaboration, both in exchanging and carrying traffic from other networks, and in solving problems that may have originated several hops away.

source: article internet-draait-om-samenwerking title
pt: Internet is all about collaboration

source: article internetnl-checks-strictness-anti-mail-spoofing-standards body
pt: Since the redesign of Internet.nl in the summer of 2017, the number of visitors increased enormously. Visitors had executed about 100 thousand tests untill July. In the second half of 2017, i.e. after the redesign, about 650 thousand tests were executed. Gerben Klein Baltink, chair of the Dutch Internet Standards Platform: > "The increase is very nice but modern internet is far from ready yet. We are happy to see a growing number of domains with a 100% score entering our Hall of Fame. At the same time there are still too many domains that do not comply with any or all of these modern Internet Standards. Therefore keep testing, learning and requiring modern internet!". ## Policy checking for DMARC and SPF This new version of Internet.nl checks if the syntax of your DMARC and SPF record is correct. Besides the test tool checks if these records contain a sufficiently strict policy in order to prevent abuse of your domain by phishers and spammers. ## Checking validity period for HSTS Internet.nl now also checks for the validity period of the HSTS policy. We consider a HSTS cache validity period of at least six months to be sufficiently secure. A long period is beneficial because it also protects infrequent visitors. However if you want to stop supporting HTTPS, you will have to wait longer until the validity of the HSTS policy in all browsers that vistited your website, has expired. ## Impact on test score The DMARC/SPF policy and the HSTS validity period do not yet impact the overall percentage score. In case of a deviation an orange warning will be displayed in the test results. As of **April 2018** the results of the test items will be part of the score. --- ## Release notes: - New: DMARC and SPF record parsers to check the record's syntax and policy strictness; - New: Check if HSTS 'max-age' value is at least 6 months; - Various UI/webdesign fixes/improvements; - Bugfixes: - DANE test is split into 'existence' and 'validity' tests. Previously, failed requests for the TLSA record resulted in an invalid result; - DNSSEC-signed domains signed with algorithms that our validating resolver currently does not support are now reported as DNSSEC-signed but insecure.

source: article internetnl-checks-strictness-anti-mail-spoofing-standards date
pt: January 9, 2018

source: article internetnl-checks-strictness-anti-mail-spoofing-standards lead
pt: Today the Dutch Internet Standards Platform launches an improved version of its test tool Internet.nl that was used to execute over 750 thousand tests in 2017. From now on the test tool does not only check if standards against mail spoofing are in place for a given domain, but also checks if these standards are configured sufficiently strict to prevent abuse of the domain.

source: article internetnl-checks-strictness-anti-mail-spoofing-standards title
pt: Internet.nl now also checks strictness anti-mail-spoofing standards

source: article internetnl-vernieuwd-hsts-en-afgedwongen-https-tellen-mee body
pt: The following improvements have been made on Internet.nl. ## Generic * The ability to choose a different language from a dropdown menu. Visitors will get the equivalent page in the selected language (if available). * The requirement that all name servers must be available over IPv6 has been cancelled. It is sufficient if at least as many name servers are available over IPv6 as there are over IPv4. This applies to both the webite test and the mail test. ## Connection test * The detection of the internet provider is more precise and timeouts occur less frequent. ## Website test * The test checks whether a HSTS-policy is available. Through HSTS a web browser will 'know' after the first visit that a website can only be accessed through a secure connection (HTTPS, not HTTP). This can prevent so-called man-in-the-middle attacks, e.g. when using public Wi-Fi. In case of deviations, the message is no longer 'orange' but 'red'. * The test now checks whether the website enforces HTTPS by using a server redirect (301 or 302) or by applying only HTTPS (and no HTTP). In case of deviations, the message is no longer 'orange' but 'red'. * In the case of some websites, the TLS results incorrectly showed that 'client-initiated renegotiation' was allowed. This has been solved. * In the test results of websites with a redirect from IPv6/IPv4 to IPv4-only, the HSTS-policy over IPv6 remained incorrectly undetected. This has been solved. * The test now checks whether actual HTTP traffic is sent over port 443. If that is not the case, the test will no longer draw incorrect conclusions which are HTTPS-related . ## Mail test * If Internet.nl cannot establish a connection to a mail server (e.g. by 'rate limiting'), visitors will now be asked to try again later. * Thanks to the improved adjustment of timeouts, failure of the test part 'STARTTLS' is less likely. Therefore certain mail servers can now be tested without problems. * Running connections serially and minimizing the number of connections should help to reduce the risk of 'rate limiting' of mail servers. Therefore certain mail servers can now be tested which was not possible before. ## Background information * [ICT-beveiligingsrichtlijnen voor webapplicaties van NCSC - Verdieping](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) under '05 Versleutel communicatie' on p.29 [Dutch]; * [ICT-beveiligingsrichtlijnen voor TLS van NCSC](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1).

source: article internetnl-vernieuwd-hsts-en-afgedwongen-https-tellen-mee date
pt: June 27, 2016

source: article internetnl-vernieuwd-hsts-en-afgedwongen-https-tellen-mee lead
pt: Today (June 27, 2016) the Dutch Internet Standard PLatform launches a new version of the website [Internet.nl](/). From now on, 'HSTS' and 'enforced HTTPS' are part of the score of the website test. This was already announced at the [previous release](/article/nieuwe-versie-internetnl-met-aanvullingen- https-test/). In addition to this change, the new version of [Internet.nl](/) includes several improvements that make testing faster and more stable.

source: article internetnl-vernieuwd-hsts-en-afgedwongen-https-tellen-mee title
pt: New version Internet.nl: 'HSTS' and 'enforced HTTPS' do count

source: article introducing-new-TLS-guidelines body
pt: ## TLS in Internet.nl The test tool [Internet.nl](https://internet.nl) checks TLS configurations for websites under the test category 'HTTPS' and for mail servers under the test category 'STARTTLS and DANE'. The latest 'IT guidelines for TLS' from NCSC-NL are used as a baseline. If a 'good' or 'sufficient' setting is found, then Internet.nl will show a green check ('passed'). In case of a 'phase out' setting, like TLS 1.0 and 1.1, you will see an orange exclamation mark ('warning'), and an 'insufficient' configuration gets a red cross ('fail'). ## ICT guidelines for TLS In April 2019 NCSC-NL published the ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls). The advised settings are future proof; as expected TLS connections which are secured according to the new guidelines will not require any modifications in the near future. At the same time the guidelines also ensure that systems remain interoperable and prevent TLS settings to be incompatible. ## 'Phase out' TLS settings 'Phase out' settings are known to be fragile and are at risk of becoming insufficiently secure. Take the following into consideration when making a decision regarding these 'phase out' settings. Browser makers have announced that they will stop supporting TLS 1.1 and 1.0 by Q1 2020. This will impact the reachability of websites that do not offer support for TLS 1.2 and/or 1.3. Quite some mail servers only support older TLS versions. If the sending and receiving mail server both do not support the same TLS version, they will usually fall back to unencrypted mail transport. Because of that it could be advisable to keep supporting TLS versions with a 'phase out' status for a while. Make an informed decision based on log data on when to disable these 'phase out' TLS versions. ## About Internet.nl The test tool Internet.nl is an initiative of the **Dutch Internet Standards Platform** which is a collaboration of partners from the internet community and the Dutch government. The aim of the platform is to jointly increase the use of modern Internet standards to make the Internet more accessible, safer and more reliable for everyone. ECP provides for the administrative home of the platform. Open Netlabs / NLnet Labs is responsible for the technical realisation of Internet.nl. --- ## Release notes - Various UI/webdesign fixes/improvements - New: - Updated TLS tests to conform to the new v2 NCSC guidelines - TLS1.3 is supported in the TLS tests - Improved Hall of Fame which adds mail tests and champions - Widget for starting the website and email test from other websites - Bugfixes: - Connection test: DNSSEC no longer defaults to secure when the bogus url is not visited and none of the others tests could be performed. It falls back to not tested instead

source: article introducing-new-TLS-guidelines date
pt: December 9, 2019

source: article introducing-new-TLS-guidelines lead
pt: As of today you can use Internet.nl to test if your website and mail are compliant with the latest 'IT Security Guidelines for TLS' from NCSC-NL. This also means that TLS 1.3 is now supported in the website and mail test.

source: article introducing-new-TLS-guidelines title
pt: New TLS guidelines landed in Internet.nl

source: article lancering-internet-nl-tijdens-cyber-week-2015 body
pt: The Internet belongs to all of us and is heavily used every day by entrepreneurs, governments and citizens. To most people, the Internet has now become indispensable. The technical fundament of the Internet, however, is completely invisible and unknown to most of its users. As a consequence, modern, secure internet standards are often implemented too late or not at all. That&#39;s the context in which the Internet Standards Platform was founded and the Internet.nl website was launched. ## Internet.nl Through Internet.nl, visitors can easily and automatically check whether their internet connection, e-mail and websites support modern, secure internet standards. If one or more standards are not up to date, the user gets guidance on how to improve this. Currently, the portal covers the following standards: - IPv6: an extended, modern range of internet addresses; - DNSSEC: security extensions for domain names; - TLS: secured connections; - DKIM, SPF and DMARC: anti-phishing and anti-spoofing. The current website is the first public release. The Platform will continue to improve and extend the website. Feedback is appreciated. ## Dutch Internet Standards Platform The Internet Standards Platform aims to increase the usage of modern and secure internet standards in order to make the Internet more reliable for everyone. The organisations participating in the Internet Standards Platform are: the Dutch Hosting Provider Association (DHPA), ECP, Standardisation Forum, Internet Society international, Internet Society Netherlands, the Dutch Ministry of Economic Affairs, the National Cyber Security Centre (NCSC), NLnet, RIPE NCC, SIDN, and SURFnet.

source: article lancering-internet-nl-tijdens-cyber-week-2015 date
pt: April 15, 2015

source: article lancering-internet-nl-tijdens-cyber-week-2015 lead
pt: During the Dutch Cyber Week 2015 the website Internet.nl was launched by the Internet Standards Platform, a collaboration among organisations from the Internet community and the Dutch government. On this website, visitors can check whether their Internet is up to date. Are your internet connection, e-mail and website actually using modern, secure internet standards? And if not, what can you do about it?

source: article lancering-internet-nl-tijdens-cyber-week-2015 title
pt: Internet.nl launched during Dutch Cyber Week 2015
