Repository: MartaMartinsXavier/Internet.nl
Catalog: translations/*/news.po
Languages: pt

source: article new-release-with-improved-tests-for-TLS-and-CSP body
pt: ## Latest TLS guidelines from NCSC-NL supported The recently updated [IT security guidelines for Transport Layer Security (TLS)](https://english.ncsc.nl/publications/publications/2021/january/19/it-security-guidelines-for-transport-layer-security-2.1) from NCSC-NL have led to the following changes in the website and mail test: 1. The security level of TLS 1.2 is downgraded from *Good* to *Sufficient* (guideline B1-1). TLS 1.3 is still *Good*. This has no impact on the Internet.nl test result, because we already considered *Sufficient* TLS versions to be enough to succeed for the subtest. However, we have included the downgrade in the test explanation of the TLS version subtest. 2. The requirements for the ordering of algorithm selections have been simplified. Only the security level now determines the prescribed ordering (guideline B2-5). We have adjusted the cipher order subtest of Internet.nl accordingly. 3. Supporting client-initiated renegotation is no longer *Insufficient*, but *Sufficient* (guideline B8-1). Internet.nl changed the requirement level for the client-initiated renegotation subtest into 'Optional'. ## CSP settings evaluated Content-Security-Policy ([CSP](https://www.w3.org/TR/CSP3/)) guards a website against content injection attacks including cross-site scripting (XSS). We now check for several (in)secure CSP settings (like `unsafe-inline` and `unsafe-eval`), although we do not exhaustively test the effectiveness of your CSP configuration. The [requirement level](/faqs/report/) of the CSP subtest has been raised from 'Optional' to 'Recommended'. ## Non-mail domains better supported We now explicitly check for non-sending and non-receiving mail configurations, and expect the following. * Non-sending domain: Use the most strict DMARC policy (`p=reject`) and SPF policy (`-all`) for your domain that you do not use for sending mail in order to prevent abuse ('spoofing'). Note that DKIM is not necessary in this case. * Non-receiving domain: In case you do not want to receive mail on your domain that has A/AAAA records, we advise you to use [Null MX](https://tools.ietf.org/html/rfc7505). In case your domain does *not* have A/AAAA records and you do not want to receive mail on it, we advise you to configure no MX record at all (i.e. even *not* an Null MX record). ## Minimum max-age for HSTS extended HTTP Strict Transport Security ([HSTS](https://tools.ietf.org/html/rfc6797)) forces a web browser to connect directly via HTTPS when revisiting your website. This helps preventing man-in-the-middle attacks. We have decided to extend the mimimum HSTS cache validity period from 6 months to 1 year (`max-age=31536000`). This is in conformance with the common good practice. Further details on the above improvements can be found in the test explanations of the relevant subtests of the [website test](/test-site/) and the [email test](/test-mail/). ## About Internet.nl The test tool Internet.nl is an initiative of the **Dutch Internet Standards Platform** which is a collaboration of partners from the internet community and the Dutch government. The aim of the platform is to jointly increase the use of modern Internet standards to make the Internet more accessible, safer and more reliable for everyone. --- ## Release notes v1.3: - New: - NCSC-NL's TLS guidelines 2.1; - Validate CSP directives; - Support non email sending domains in mailtest for DKIM test; - Explicitly test for NULL MX; - Support for SSL_OP_PRIORITIZE_CHACHA; - Keep and display the organizational domain for DMARC; - 100% badges page in knowledge base; - Ignore nonces for IPv4 vs IPv6 comparison; - Accessibility statement for Internet.nl; - Use IDNA2008. - Changes: - Minimum max-age for HSTS is now 1 year; - Accept all 3xx+3xx and 3xx+2xx DANE rollover schemes; - Ignore PKIX TLSA records for email test; - Make X-Frame-Options optional and no longer consider ALLOW-FROM as sufficiently secure. - Bugfixes: - Detect more ciphers that are available only with the modern openssl library; - Better exception handling for untrusted certificate in OCSP check; - Better exception handling for invalid IDNs.

source: article new-release-with-improved-tests-for-TLS-and-CSP date
pt: March 15, 2021

source: article new-release-with-improved-tests-for-TLS-and-CSP lead
pt: As of today you can use a new version of Internet.nl with improved tests for TLS and Content Security Policy. Furthermore, there are several changes, such as improved support for non-mail domains and the extension of the minimum HSTS cache validity period. Have fun with even better testing on modern Internet standards!

source: article new-release-with-improved-tests-for-TLS-and-CSP title
pt: New Internet.nl with improved tests for TLS and CSP

source: article next-major-release-will-use-new-TLS-guidelines body
pt: On April 23rd the NCSC published new [IT Security Guidelines for TLS](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) (version 2.0). The Dutch Internet Standards Platform was happy to provide feedback during the reviewing phase of the document. The next major release of Internet.nl will use the new TLS guidelines to check TLS connections. Internet.nl currently uses the previous version of the IT Security Guidelines for TLS (version 1.0 from 2014) for checking whether TLS settings are at least “Sufficient”. When using the new TLS guidelines organizations can achieve secure TLS connections for their internet connections. The advised settings are future proof; as expected TLS connections which are secured according to the new guidelines will not require any modifications in the near future. At the same time the guidelines also ensure that systems remain interoperable and prevent TLS settings to be incompatible. TLS is an open standard and forms the basis for other standards like HTTPS (secure website connections) and STARTTLS (secure mail server connections). The new TLS guidelines include TLS version 1.3 which was added to the [‘comply-or-explain’ list](https://www.forumstandaardisatie.nl/open-standaarden/lijst/verplicht?f%5B0%5D=field_standard_domain%3A4) of the Dutch Standardisation Forum at the end of 2018. Besides the addition of TLS 1.3, the new TLS guidelines contain some other changes like the new security level “Phase out” for TLS versions 1.0 and 1.1. The Dutch Data Protection Authority [stated](https://autoriteitpersoonsgegevens.nl/nl/nieuws/nieuwe-ict-beveiligingsrichtlijnen-voor-transport-layer-security-tls) that organizations which are still using ‘phased out’ TLS configuration settings, need to replace them in the near future since these settings might not meet the security requirements resulting from the GDPR.

source: article next-major-release-will-use-new-TLS-guidelines date
pt: May 2, 2019

source: article next-major-release-will-use-new-TLS-guidelines lead
pt: The next major release of Internet.nl will use the new IT Security Guidelines for TLS (version 2.0) from the NCSC to check TLS connections. Internet.nl currently uses the previous version of the IT Security Guidelines for TLS (version 1.0 from 2014) for checking whether TLS settings are at least “Sufficient”.

source: article next-major-release-will-use-new-TLS-guidelines title
pt: Next major release of Internet.nl will use the new TLS guidelines

source: article nieuwe-versie-internetnl-met-aanvullingen-https-test body
pt: Below we describe the major changes. * The previous version of Internet.nl did test the **security of the HTTPS configuration over either IPv6 or IPv4**. Through manual testing we regularly see websites that have unintended different HTTPS configurations over IPv6 and IPv4. Therefore in the new release the HTTPS configuration is tested over both IPv6 and IPv4. **From now on** the result of this test item is part of the overall score in the website test. * The website tests checks whether a **HSTS policy** is published. Through HSTS a web browser gets informed after the first usage that a website only may be visited over HTTPS. This can prevent so-called man-in-the-middle attacks (for example when a public Wi-Fi hotspot is used). The result of this test item is displayed as an orange warning in case the HSTS policy is absent. As of **July 2016** the result will be part of the score in the website test. * The website test does test whether **HTTPS is enforced** for a website. There are two ways to enforce HTTPS that are described below.The result of this test item is displayed as an orange warning in case the HSTS policy is absent. As of **July 2016** the result will be part of the score in the website test. 1. By redirecting HTTP to HTTPS. This can be done by redirecting `http://example.nl` to `https://example.nl`. It is important that both domain names are identical because a web browser does only accept a HSTS policy for a certain domain when a HTTPS connection is used. If `http://example.nl` redirects to `https://www.example.nl` then a HSTS policy normally will not be used by the browser, unless a user explicitly enters `https://example.nl` or clicks on a hyperlink with this URL. 2. By only supporting HTTPS and no HTTP. Because a browser normally uses a HTTP-connection after a user enters a domain name, users should enter `https://example.nl` to reach the website or click on a hyperlink with this URL. * The website test does check whether **HTTP compression** is used. Enabling HTTP compression does make many websites vulnerable for BREACH when no other mitigating measures are in place. Switching off HTTP compression could negatively impact performance. In case HTTP compression is detected an **orange warning** is displayed. * The website test of the previous version of Internet.nl already checked whether the **content of a website was similar over IPv6 and IPv4**. The test took into account legitimate differences for example caused by different add banners. The result of this test item **from now on** is part of the overall score in the website test. * If a user does enter a **non-existing domain name** a red error message is displayed. *** **More information:** * [ICT-Beveiligingsrichtlijnen voor Webapplicaties van NCSC](https://www.ncsc.nl/actueel/whitepapers/ict-beveiligingsrichtlijnen-voor-webapplicaties.html) [Dutch] * [ICT-beveiligingsrichtlijnen voor Transport Layer Security (TLS)](https://www.ncsc.nl/actueel/whitepapers/ict-beveiligingsrichtlijnen-voor-transport-layer-security-tls.html) [Dutch] * [RFC 6797: HTTP Strict Transport Security (HSTS)](https://tools.ietf.org/html/rfc6797) * [Breach Attack](http://breachattack.com/)

source: article nieuwe-versie-internetnl-met-aanvullingen-https-test date
pt: March 19, 2016

source: article nieuwe-versie-internetnl-met-aanvullingen-https-test lead
pt: As of today a new version of [Internet.nl](https://en.Internet.nl) is available. This new release contains improvements and extensions, especially for the HTTPS/TLS part of the website test. Since April last year users executed 80,000 tests on [Internet.nl](https://en.Internet.nl). Hopefully you like this new version and you keep on testing and improving your Internet. Happy testing!!!

source: article nieuwe-versie-internetnl-met-aanvullingen-https-test title
pt: New version Internet.nl with extended HTTPS test

source: article novostestes-21Mar2022 body
pt: DANE (DNS-based Authentication of Named Entities) é um protocolo que adiciona uma camada adicional de proteção ao serviço website ou email, uma vez que permite especificar informação no sistema DNS sobre o certificado que deverá ser utilizado para acesso ao seu website/email. Este protocolo tem como requisito a implementação de DNSSEC. Por sua vez, Renegociação Segura permite verificar se os servidores web ou de email suportam a renegociação segura do momento de ligação com protocolo TLS. O webcheck.pt é uma plataforma online, desenvolvida pelo .PT e pelo Centro Nacional de Cibersegurança, que permite aos utilizadores verificar, em tempo real, o nível de conformidade de um domínio de internet e de um email com os mais recentes standards para a comunicação segura entre sistemas como, por exemplo, HTTPS, DNSSEC ou SPF. Verifique se o seu domínio está em conformidade com as boas práticas, e contribua para um ciberespaço mais seguro!

source: article novostestes-21Mar2022 date
pt: 21 Março 2022

source: article novostestes-21Mar2022 lead
pt: O Webcheck.pt acaba de introduzir novas verificações a protocolos e funcionalidades de segurança: DANE e Renegociação Segura.

source: article novostestes-21Mar2022 title
pt: Novos testes a protocolos e funcionalidades de segurança

source: article open-source-release body
pt: ## Open source The software source code of Internet.nl is published under the Apache License, version 2.0 on [Github](https://github.com/NLnetLabs/Internet.nl). Internet.nl was made possible by using and combining other open source software. The main open source building blocks of Internet.nl are Python 3, Django, PostgreSQL, Celery, Redis, RabbitMQ, nassl, unbound/libunbound and Postfix. Please see [copyright page](/copyright/) for further information. ## Test for application security options The website test has a new test category for [application security options](/faqs/appsecpriv/). These settings can be sent to the browser via HTTP headers and are often referred to as 'security headers'. The new category contains tests for X-Frame-Options, X-Content-Type-Options, X-XSS-Protection, Content-Security-Policy and Referrer-Policy. For the latter two we check for their existence but do not evaluate the effectivenes of the configured policy. Currently the results of the new tests do not impact the overall score. ## About Internet.nl The test tool Internet.nl is an initiative of the Dutch Internet Standards Platform which is a collaboration of partners from the internet community and the Dutch government. The platform's mission is to jointly promote the use of modern internet standards keeping the internet reliable and accessible for everybody. ECP provides for the administrative home of the platform. NLnet Labs is responsible for the technical realisation and implementation of the test tool. --- ## Release notes - New features: - New "Security Options" for the website test to check security HTTP headers; - Changes: - DMARC verification now uses Mozilla's public suffix list for finding the organizational domain; - DMARC validation now gives a warning if rua/ruf is not valid; - Added link to test explanation on connection results; - New way of showing verdict for failed categories; - Bug fixes: - Fixed DMARC external report addresses and validation when multiple URIs; - Ignore MX records that include 'localhost'; - Home page statistics numbers sometimes weren't adding up; - Several content improvements.

source: article open-source-release date
pt: February 21, 2019

source: article open-source-release lead
pt: As of today the source code of Internet.nl is available under an open source license, making it possible to verify its workings and run your own local instance. Furthermore we added a new test category for application security options or security headers.

source: article open-source-release title
pt: Open source release Internet.nl including 'security headers'

source: article release-1.7 body
pt: ## Improved CSP test Specific error messages were added to the technical details in the Content-Security-Policy (CSP) test. This makes it clearer to users what is wrong with their CSP policy and enables them to make their policy more secure. Furthermore, the CSP test now also checks for secure settings of the `base-uri` and `form-action` directives. According to the CSP specification, both directives are not covered by the fallback policy of `default-src` and thus it is important to configure them explicitly. ## Security.txt and TLS test improvements For the security.txt test Dutch translations were added, the validation library was updated and several bug fixes were made. Furthermore, in the test for TLS version, users can now see all detected TLS versions. So, if detected, also TLS version 1.2 and 1.3 with a 'sufficient' and 'good' security level, respectively, are now displayed in the technical table. ## About Internet.nl The test tool [Internet.nl](https://internet.nl) is an initiative of the Dutch Internet Standards Platform which is a collaboration of partners from the Internet community and the Dutch government. The aim of the platform is to jointly increase the use of modern Internet standards to make the Internet more accessible, safer and more reliable for everyone. The software code of Internet.nl is available under an open source license. --- ## Release notes 1.7.0 - Added specific [error messages in the technical details](https://github.com/internetstandards/Internet.nl/issues/577) for Content-Security-Policy results. - Added requirements for [base-uri](https://github.com/internetstandards/Internet.nl/issues/525) and [form-action](https://github.com/internetstandards/Internet.nl/issues/524) to the Content-Security-Policy test. - Added translations for [security.txt error messages](https://github.com/internetstandards/Internet.nl/issues/774). - The TLS versions tech table [now shows the detected TLS versions](https://github.com/internetstandards/Internet.nl/issues/512) instead of only TLS versions with issues. - Fixed an [uncaught exception](https://github.com/internetstandards/Internet.nl/issues/494) in the security.txt text which could cause the entire test to fail for some HTTP responses. - Corrected handling of [bogus TLSA records](https://github.com/internetstandards/Internet.nl/issues/681). - A bare "https:" is [no longer allowed in Content-Security-Policy](https://github.com/internetstandards/Internet.nl/pull/925) as it matches any HTTPS host. - [Loosened requirement for null MX](https://github.com/internetstandards/Internet.nl/issues/748) when a domain has no A or AAAA. - Fixed an issue where the [frame-src test was inconsistent with the documentation](https://github.com/internetstandards/Internet.nl/issues/643). - [Added the version number](https://github.com/internetstandards/Internet.nl/issues/494) to the footer. - [Added Sentry support](https://github.com/internetstandards/Internet.nl/issues/770) for error reporting. - Code quality was cleaned up in various places. - Dependencies were updated. - New content for extended tests and several other content improvements. This release has API version 2.3.0: - The `record_org_domain` was added for DMARC ([#489](https://github.com/internetstandards/Internet.nl/issues/489)). - The `securitytxt_errors` and `securitytxt_recommendations` types were changed. They now contain error codes (and possibly context) rather than full sentences. - The `content_security_policy_errors` field was added with error codes for CSP. - An issue was fixed where the `mx_nameservers` field was not included in results ([#882](https://github.com/internetstandards/Internet.nl/issues/882)).

source: article release-1.7 date
pt: April 11, 2023

source: article release-1.7 lead
pt: As of today, you can use a new version of Internet.nl with an improved test for Content-Security-Policy and for security.txt. In addition, several other improvements have been made, including bug fixes, code cleanup, updates of used external software libraries, and content improvements.

source: article release-1.7 title
pt: Improved tests for CSP and security.txt on Internet.nl

source: article relatorio-riscosconflitos-23Jun2022 date
pt: 23 Junho 2022

source: article relatorio-riscosconflitos-23Jun2022 lead
pt: O Relatório Riscos & Conflitos 2022, do Observatório de Cibersegurança do Centro Nacional de Cibersegurança (CNCS), foi recentemente publicado e analisa os principais incidentes, cibercrimes e agentes de ameaça a afetar o ciberespaço de interesse nacional, bem como algumas tendências que podem marcar o futuro a este nível.

source: article relatorio-riscosconflitos-23Jun2022 title
pt: Conheça o mais recente Relatório Riscos & Conflitos 2022 do Observatório de Cibersegurança

source: article ptsoc-nwes-8Jul2022 body
pt: A 5ª edição da PTSOC News encontra-se disponível [aqui](https://ptsoc.pt.pt/pt/publicacoes/)

source: article ptsoc-nwes-8Jul2022 date
pt: 8 Julho 2022

source: article ptsoc-nwes-8Jul2022 lead
pt: O .PT acaba de lançar a 5ª edição da revista PTSOC News, onde poderá ficar a saber mais sobre as passkeys e a próxima evolução das passwords, e ler a entrevista à Presidente da Women4Cyber Portugal, Cristina Almeida. Destacamos ainda o artigo sobre Autenticação de dois fatores (2FA) por José Ramos, Cybersecurity Analyst do .PT.

source: article ptsoc-nwes-8Jul2022 title
pt: PTSOC News: 5ª Edição já disponível

source: article uitnodiging-masterclass-DMARC body
pt: During this masterclass one of the founders of DMARC, Tim Draegen, will inform you on the going ons of this security standard. Masterclass DMARC Date: Tuesday April 21 Time: 15:00 until 17:00 (drinks afterwards) Location: 7AM, Buitenhof 47, The Hague ## Joining Free of charge, however the number of participants is limited. You can sign up using the [website of ECP](https://ecp.nl/agenda/masterclass-dmarc/).

source: article uitnodiging-masterclass-DMARC lead
pt: On Tuesday April 21st the Platform Internetstandards organises a Masterclass on the topic of [DMARC](/faqs/mail/#DMARC).

source: article uitnodiging-masterclass-DMARC title
pt: Invitation Masterclass DMARC
